{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7f81f75b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "15875425",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "sys.path.insert(0, \"..\")\n",
    "\n",
    "from schema_utils import get_schema\n",
    "from utils import neo4j_driver, chat"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f18887a2",
   "metadata": {},
   "outputs": [],
   "source": [
    "prompt_template = \"\"\"\n",
    "Instructions: \n",
    "Generate Cypher statement to query a graph database to get the data to answer the user question below.\n",
    "\n",
    "Graph Database Schema:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided in the schema.\n",
    "{schema}\n",
    "\n",
    "Terminology mapping:\n",
    "This section is helpful to map terminology between the user question and the graph database schema.\n",
    "{terminology}\n",
    "\n",
    "Examples:\n",
    "The following examples provide useful patterns for querying the graph database.\n",
    "{examples}\n",
    "\n",
    "Format instructions:\n",
    "Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to \n",
    "construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "ONLY RESPOND WITH CYPHER, NO CODEBLOCKS.\n",
    "\n",
    "User question: {question}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "732edb6c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Person {name: STRING, born: INTEGER}\n",
      "Movie {tagline: STRING, title: STRING, released: INTEGER}\n",
      "Relationship properties:\n",
      "ACTED_IN {roles: LIST}\n",
      "REVIEWED {summary: STRING, rating: INTEGER}\n",
      "The relationships:\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:PRODUCED]->(:Movie)\n",
      "(:Person)-[:WROTE]->(:Movie)\n",
      "(:Person)-[:FOLLOWS]->(:Person)\n",
      "(:Person)-[:REVIEWED]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "schema_string = get_schema(neo4j_driver)\n",
    "print(schema_string)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "37ed2291",
   "metadata": {},
   "outputs": [],
   "source": [
    "terminology_string = \"\"\"\n",
    "Persons: When a user asks about a person by trade like actor, writer, director, producer, reviewer, they are referring to a node with the label 'Person'.\n",
    "Movies: When a user asks about a film or movie, they are referring to a node with the label Movie.\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "de5deaad",
   "metadata": {},
   "outputs": [],
   "source": [
    "examples = [\n",
    "    [\"Who are the two people acted in most movies together?\", \n",
    "     \"MATCH (p1:Person)-[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(p2:Person) WHERE p1 <> p2 RETURN p1.name, p2.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1\"]\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "5f6cd82c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Instructions: \n",
      "Generate Cypher statement to query a graph database to get the data to answer the user question below.\n",
      "\n",
      "Graph Database Schema:\n",
      "Use only the provided relationship types and properties in the schema.\n",
      "Do not use any other relationship types or properties that are not provided in the schema.\n",
      "Node properties:\n",
      "Person {name: STRING, born: INTEGER}\n",
      "Movie {tagline: STRING, title: STRING, released: INTEGER}\n",
      "Relationship properties:\n",
      "ACTED_IN {roles: LIST}\n",
      "REVIEWED {summary: STRING, rating: INTEGER}\n",
      "The relationships:\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:PRODUCED]->(:Movie)\n",
      "(:Person)-[:WROTE]->(:Movie)\n",
      "(:Person)-[:FOLLOWS]->(:Person)\n",
      "(:Person)-[:REVIEWED]->(:Movie)\n",
      "\n",
      "Terminology mapping:\n",
      "This section is helpful to map terminology between the user question and the graph database schema.\n",
      "\n",
      "Persons: When a user asks about a person by trade like actor, writer, director, producer, reviewer, they are referring to a node with the label 'Person'.\n",
      "Movies: When a user asks about a film or movie, they are referring to a node with the label Movie.\n",
      "\n",
      "\n",
      "Examples:\n",
      "The following examples provide useful patterns for querying the graph database.\n",
      "Question: Who are the two people acted in most movies together?\n",
      "Cypher: MATCH (p1:Person)-[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(p2:Person) WHERE p1 <> p2 RETURN p1.name, p2.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1\n",
      "\n",
      "Format instructions:\n",
      "Do not include any explanations or apologies in your responses.\n",
      "Do not respond to any questions that might ask anything else than for you to \n",
      "construct a Cypher statement.\n",
      "Do not include any text except the generated Cypher statement.\n",
      "ONLY RESPOND WITH CYPHER, NO CODEBLOCKS.\n",
      "\n",
      "User question: Who directed the most movies?\n",
      "\n"
     ]
    }
   ],
   "source": [
    "question = \"Who directed the most movies?\"\n",
    "\n",
    "formatted_examples = \"\\n\".join([f\"Question: {e[0]}\\nCypher: {e[1]}\" for i, e in enumerate(examples)])\n",
    "\n",
    "full_prompt = prompt_template.format(question=question, schema=schema_string, terminology=terminology_string,examples=formatted_examples)\n",
    "print(full_prompt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "041b8711",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE NOT p <> RETURN p.name, COUNT(m) AS movieDirected ORDER BY movieDirected DESC LIMIT 1\n"
     ]
    }
   ],
   "source": [
    "cypher = chat(messages=[{\"role\": \"user\", \"content\": full_prompt}])\n",
    "print(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e8706307",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv (3.13.7)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
