{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "578419d8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8387115e",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "\n",
    "sys.path.append(\"..\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "18157a94",
   "metadata": {},
   "outputs": [],
   "source": [
    "import importlib\n",
    "from utils import neo4j_driver, num_tokens_from_string, chunk_text, chat, embed\n",
    "import ch07_tools\n",
    "importlib.reload(ch07_tools)\n",
    "\n",
    "import json\n",
    "import requests\n",
    "\n",
    "from tqdm import tqdm\n",
    "from typing import List, Dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "fcec02d1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Project Gutenberg eBook of The Odyssey\n",
      "    \n",
      "This eBook is for the use of anyone anywhere in the United States and\n",
      "most other parts of the world at no cost and with almost no restrictions\n",
      "whatsoever. You may copy it, give it away or re-use it under the terms\n",
      "of the Project Gutenberg License included with this eBook or online\n",
      "at www.gutenberg.org. If you are not located in the United States,\n",
      "you will have to check the laws of the country where you are located\n",
      "before using this eBook.\n",
      "\n",
      "Title: \n"
     ]
    }
   ],
   "source": [
    "text = \"\"\n",
    "\n",
    "with open(\"../data/pg1727.txt\", \"r\") as f:\n",
    "    text = f.read()\n",
    "\n",
    "print(text[:500])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7917f2ac",
   "metadata": {},
   "outputs": [],
   "source": [
    "def chunk_into_books(text: str) -> List[str]:\n",
    "    return (\n",
    "        text.split(\"PREFACE TO FIRST EDITION\")[2]\n",
    "        .split(\"FOOTNOTES\")[0]\n",
    "        .strip()\n",
    "        .split(\"\\nBOOK\")[1:]\n",
    "    )\n",
    "\n",
    "books = chunk_into_books(text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "c5bbc984",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 24 books with token sizes:\n",
      "    - avg 6486.791666666667\n",
      "    - min 4444\n",
      "    - max 10709\n",
      "\n"
     ]
    }
   ],
   "source": [
    "token_count = [num_tokens_from_string(el) for el in books]\n",
    "print(\n",
    "    f\"\"\"There are {len(token_count)} books with token sizes:\n",
    "    - avg {sum(token_count) / len(token_count)}\n",
    "    - min {min(token_count)}\n",
    "    - max {max(token_count)}\n",
    "\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "ce7b959f",
   "metadata": {},
   "outputs": [],
   "source": [
    "chunked_books = [chunk_text(book, 1000, 40) for book in books]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "c2c7755e",
   "metadata": {},
   "outputs": [],
   "source": [
    "ENTITY_TYPES = [\n",
    "    \"PERSON\",\n",
    "    \"ORGANIZATION\",\n",
    "    \"LOCATION\",\n",
    "    \"GOD\",\n",
    "    \"EVENT\",\n",
    "    \"CREATURE\",\n",
    "    \"WEAPON_OR_TOOL\",\n",
    "]\n",
    "def extract_entities(text: str) -> List[Dict]:\n",
    "    # Construct prompt\n",
    "    messages = [\n",
    "        {\"role\": \"user\", \"content\": ch07_tools.create_extraction_prompt(ENTITY_TYPES, text)},\n",
    "    ]\n",
    "    # Make the LLM call\n",
    "    output = chat(messages, model = \"gpt-5.1\")\n",
    "    # Construct JSON from output\n",
    "    return ch07_tools.parse_extraction_output(output)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "59228aa6",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing Books: 100%|██████████| 1/1 [15:26<00:00, 926.07s/it]\n"
     ]
    }
   ],
   "source": [
    "number_of_books = 1\n",
    "for book_i, book in enumerate(\n",
    "    tqdm(chunked_books[:number_of_books], desc=\"Processing Books\")\n",
    "):\n",
    "    for chunk_i, chunk in enumerate(tqdm(book, desc=f\"Book {book_i}\", leave=False)):\n",
    "        nodes, relationships = extract_entities(chunk)\n",
    "        neo4j_driver.execute_query(\n",
    "            ch07_tools.import_nodes_query,\n",
    "            data=nodes,\n",
    "            book_id=book_i,\n",
    "            text=chunk,\n",
    "            chunk_id=chunk_i,\n",
    "        )\n",
    "        neo4j_driver.execute_query(\n",
    "            ch07_tools.import_relationships_query, data=relationships\n",
    "        )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "5be6033c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'type': 'entity', 'count': 179}, {'type': 'relationship', 'count': 559}]\n"
     ]
    }
   ],
   "source": [
    "data, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (:`__Entity__`)\n",
    "    RETURN 'entity' AS type, count(*) AS count\n",
    "    UNION\n",
    "    MATCH ()-[:RELATIONSHIP]->()\n",
    "    RETURN 'relationship' AS type, count(*) AS count\n",
    "    \"\"\"\n",
    ")\n",
    "print([el.data() for el in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "ae52eccf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[['Orestes is the son of Agamemnon, who avenges his father’s murder by killing Aegisthus.', 'Orestes is an individual fated to take revenge on Aegisthus when he grew up and returned home.', \"Orestes is a famed figure known for killing Aegisthus, who murdered his father. Orestes is celebrated in song and regarded as an exemplar of avenging one's family.\", 'Orestes is the son of Agamemnon who kills Aegisthus in retribution for the murder of his father', \"Orestes is a mortal son who, when grown, takes revenge on Aegisthus for his father's murder upon returning home.\", 'Orestes is cited as a heroic figure whose fame comes from avenging his father by killing his father’s murderer, Aegisthus. His example is used to inspire Telemachus to take decisive action against the suitors.']]\n"
     ]
    }
   ],
   "source": [
    "data, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (n:PERSON)\n",
    "WHERE n.name = \"ORESTES\"\n",
    "RETURN n.description AS description\"\"\"\n",
    ")\n",
    "print([el.data()['description'] for el in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "9665a7b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'source': 'TELEMACHUS', 'target': 'ULYSSES', 'countOfRels': 14, 'descriptions': ['Telemachus believes his father Ulysses is dead and refers to rumors and prophecies about his return', 'Telemachus is the son of Ulysses and compares his hoped-for role as chief in Ithaca to that of his father', 'Telemachus identifies Ulysses as the man he is told is his father and is said to resemble him in head and eyes', 'Telemachus is the son of Ulysses and is tasked with seeking news of his father’s return', \"Telemachus is the son of Ulysses and is concerned with his father's fate\", 'Telemachus is the son of Ulysses, whose absence prompts the dispute over leadership', 'Ulysses is the father of Telemachus, whose presumed death shapes Telemachus’s situation', 'Ulysses is the father of Telemachus, who now asserts authority in his father’s house', 'Ulysses is the reputed father of Telemachus, who is described as wonderfully like him and as the continuation of his race', 'Telemachus is Ulysses’ son, implied by the traditional context of Ithaca and the suitors', 'Ulysses is the father of Telemachus', 'Ulysses is the father of Telemachus.', \"Ulysses is the father of Telemachus and the reason for Telemachus' quest\", 'Telemachus is believed to be the son of Ulysses, and others, including Minerva, remark on their resemblance']}]\n"
     ]
    }
   ],
   "source": [
    "data, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (n:__Entity__)-[:RELATIONSHIP]-(m:__Entity__)\n",
    "WITH n,m, count(*) AS countOfRels\n",
    "ORDER BY countOfRels DESC LIMIT 1\n",
    "MATCH (n)-[r:RELATIONSHIP]-(m)\n",
    "RETURN n.name AS source, m.name AS target, countOfRels, collect(r.description) AS descriptions\n",
    "\"\"\"\n",
    ")\n",
    "print([el.data() for el in data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "010dbbfd",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Summarizing entities: 100%|██████████| 93/93 [03:58<00:00,  2.57s/it]\n"
     ]
    }
   ],
   "source": [
    "candidates_to_summarize, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (e:__Entity__) WHERE size(e.description) > 1 \n",
    "    RETURN e.name AS entity_name, e.description AS description_list\"\"\"\n",
    ")\n",
    "summaries = []\n",
    "for candidate in tqdm(candidates_to_summarize, desc=\"Summarizing entities\"):\n",
    "    messages = [\n",
    "        {\n",
    "            \"role\": \"user\",\n",
    "            \"content\": ch07_tools.get_summarize_prompt(\n",
    "                candidate[\"entity_name\"], candidate[\"description_list\"]\n",
    "            ),\n",
    "        },\n",
    "    ]\n",
    "    summary = chat(messages, model=\"gpt-5.4\")\n",
    "    summaries.append({\"entity\": candidate[\"entity_name\"], \"summary\": summary})\n",
    "\n",
    "ch07_tools.import_entity_summary(neo4j_driver, summaries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "a6e6ee79",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Orestes is the son of Agamemnon and a mortal heroic figure famed for avenging his father’s murder. After growing up and returning home, he fulfills his fate by killing Aegisthus, the man who murdered Agamemnon. Orestes is celebrated in song and remembered as an exemplar of familial vengeance and decisive action, and his story is invoked as an inspiring model for Telemachus to act boldly against the suitors.\n"
     ]
    }
   ],
   "source": [
    "summary, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (n:PERSON)\n",
    "WHERE n.name = \"ORESTES\"\n",
    "RETURN n.summary AS summary\"\"\")\n",
    "print(summary[0]['summary'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "dba0f0d1",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Summarizing relationships: 100%|██████████| 127/127 [02:08<00:00,  1.01s/it]\n"
     ]
    }
   ],
   "source": [
    "rels_to_summarize, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (s:__Entity__)-[r:RELATIONSHIP]-(t:__Entity__)\n",
    "    WHERE id(s) < id(t)\n",
    "    WITH s.name AS source, t.name AS target, \n",
    "           collect(r.description) AS description_list,\n",
    "           count(*) AS count\n",
    "    WHERE count > 1\n",
    "    RETURN source, target, description_list\"\"\"\n",
    ")\n",
    "rel_summaries = []\n",
    "for candidate in tqdm(rels_to_summarize, desc=\"Summarizing relationships\"):\n",
    "    entity_name = f\"{candidate['source']} relationship to {candidate['target']}\"\n",
    "    messages = [\n",
    "        {\n",
    "            \"role\": \"user\",\n",
    "            \"content\": ch07_tools.get_summarize_prompt(\n",
    "                entity_name, candidate[\"description_list\"]\n",
    "            ),\n",
    "        },\n",
    "    ]\n",
    "    summary = chat(messages, model=\"gpt-5.4-mini\")\n",
    "    rel_summaries.append({\"source\": candidate[\"source\"], \"target\": candidate[\"target\"], \"summary\": summary})\n",
    "\n",
    "ch07_tools.import_rels_summary(neo4j_driver, rel_summaries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "22deac7d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Minerva has a close, guiding relationship with Telemachus during her visit to Ithaca. Telemachus is the first to notice Minerva and goes to greet her, welcoming and honoring her as a guest, though he initially believes her to be Mentes. During the banquet, he speaks quietly and confides his thoughts to Minerva so that no one else can hear. Minerva in turn speaks directly to him, questions him about the feasting, reassures him about his lineage, and praises him as Penelope’s fine son. She encourages him, gives him courage, and offers advice about his planned voyage. Her guidance leaves a strong impression on Telemachus, who thinks all night about the counsel Minerva has given him and is made to reflect more deeply than ever on his father.\n"
     ]
    }
   ],
   "source": [
    "data, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (n:__Entity__)-[r:SUMMARIZED_RELATIONSHIP]-(m:__Entity__)\n",
    "WHERE n.name = 'TELEMACHUS' AND m.name = 'MINERVA'\n",
    "RETURN r.summary AS description\n",
    "\"\"\"\n",
    ")\n",
    "print(data[0][\"description\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "a0a9e50a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 10 communities with distribution: {'p1': 1, 'max': 60, 'p5': 1, 'p90': 41, 'p50': 9, 'p95': 60, 'p10': 1, 'p75': 30, 'p99': 60, 'p25': 4, 'min': 1, 'mean': 17.9, 'p999': 60}\n"
     ]
    }
   ],
   "source": [
    "community_distribution = ch07_tools.calculate_communities(neo4j_driver)\n",
    "print(f\"There are {community_distribution['communityCount']} communities with distribution: {community_distribution['communityDistribution']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "d08d2911",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Summarizing communities: 100%|██████████| 9/9 [02:01<00:00, 13.51s/it]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7e915fa5b890>, keys=[])"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "community_info, _, _ = neo4j_driver.execute_query(ch07_tools.community_info_query)\n",
    "\n",
    "communities = []\n",
    "for community in tqdm(community_info, desc=\"Summarizing communities\"):\n",
    "    messages = [\n",
    "        {\n",
    "            \"role\": \"user\",\n",
    "            \"content\": ch07_tools.get_summarize_community_prompt(\n",
    "                community[\"nodes\"], community[\"rels\"]\n",
    "            ),\n",
    "        },\n",
    "    ]\n",
    "    summary = chat(messages, model=\"gpt-5.4-mini\")\n",
    "    communities.append(\n",
    "        {\n",
    "            \"community\": json.loads(ch07_tools.extract_json(summary)),\n",
    "            \"communityId\": community[\"communityId\"],\n",
    "            \"nodes\": [el[\"id\"] for el in community[\"nodes\"]],\n",
    "        }\n",
    "    )\n",
    "\n",
    "neo4j_driver.execute_query(ch07_tools.import_community_query, data=communities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "a62799a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ithaca: Odysseus, Telemachus, Penelope, and the Suitors\n",
      "This community centers on Ithaca and the House of Ulysses, where Odysseus is the absent rightful ruler and Telemachus, Penelope, and a large group of suitors are locked in a struggle over household authority and inheritance. Telemachus is coming of age under pressure from the suitors, who occupy the estate, consume its wealth, and seek Penelope’s hand, while Penelope remains loyal but grief-stricken and Phemius provides music at the feasts. The situation is further complicated by notable suitors such as Antinous and Eurymachus, the involvement of servants and banqueting arrangements, and Telemachus’s plans to confront the disorder through action, counsel from the goddess, and a proposed assembly of the Achaeans.\n"
     ]
    }
   ],
   "source": [
    "data, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"MATCH (c:__Community__)\n",
    "WITH c, count {(c)<-[:IN_COMMUNITY]-()} AS size\n",
    "ORDER BY size DESC LIMIT 1\n",
    "RETURN c.title AS title, c.summary AS summary\n",
    "\"\"\"\n",
    ")\n",
    "print(data[0][\"title\"])\n",
    "print(data[0][\"summary\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "e6156650",
   "metadata": {},
   "outputs": [],
   "source": [
    "def global_retriever(query: str, rating_threshold: float = 5) -> str:\n",
    "    community_data, _, _ = neo4j_driver.execute_query(\n",
    "        \"\"\"\n",
    "    MATCH (c:__Community__)\n",
    "    WHERE c.rating >= $rating\n",
    "    RETURN c.summary AS summary\n",
    "    \"\"\",\n",
    "        rating=rating_threshold,\n",
    "    )\n",
    "    print(f\"Got {len(community_data)} community summaries\")\n",
    "    intermediate_results = []\n",
    "    for community in tqdm(community_data, desc=\"Processing communities\"):\n",
    "        intermediate_messages = [\n",
    "            {\n",
    "                \"role\": \"system\",\n",
    "                \"content\": ch07_tools.get_map_system_prompt(community[\"summary\"]),\n",
    "            },\n",
    "            {\n",
    "                \"role\": \"user\",\n",
    "                \"content\": query,\n",
    "            },\n",
    "        ]\n",
    "        intermediate_response = chat(intermediate_messages, model=\"gpt-5.4-mini\")\n",
    "        intermediate_results.append(intermediate_response)\n",
    "\n",
    "    final_messages = [\n",
    "        {\n",
    "            \"role\": \"system\",\n",
    "            \"content\": ch07_tools.get_reduce_system_prompt(intermediate_results),\n",
    "        },\n",
    "        {\"role\": \"user\", \"content\": query},\n",
    "    ]\n",
    "    summary = chat(final_messages, model=\"gpt-5.4-mini\")\n",
    "    return summary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "bc26109a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Got 7 community summaries\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing communities: 100%|██████████| 7/7 [01:10<00:00, 10.09s/it]\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The story is principally about Odysseus (Ulysses) and his arduous journey back to Ithaca following the Trojan War, a journey fraught with trials both terrestrial and divine. The narrative unfolds over two primary loci: Ithaca, where Odysseus's household faces an internal crisis, and the broader mythological realm, where gods and mythical elements influence the human saga. \n",
      "\n",
      "### Ithaca's Crisis\n",
      "\n",
      "At the heart of the story's dramatic tension is the situation in Ithaca, where Telemachus (Odysseus's son) and Penelope (his wife) are grappling with a cohort of opportunistic suitors. These suitors have overrun Odysseus's home, consuming its resources and seeking Penelope’s hand in marriage, thereby threatening the household's legacy in the absence of its rightful head [Data: Reports]. Telemachus, coming of age amidst this chaos, is notably growing in authority as he attempts to maintain order and plan for action against the suitors [Data: Entities (TELEMACHUS, SUITORS, HOUSE OF ULYSSES)].\n",
      "\n",
      "Minerva (Athena) plays a pivotal role in this setting, offering her divine protection and counsel to both Telemachus and Penelope, guiding them through the turmoil inflicted by the suitors [Data: Relationships (MINERVA-TELEMACHUS, MINERVA-PENELOPE)]. Penelope endures with remarkable fidelity to Odysseus, despite her grief and the pressure from the suitors [Data: Relationships (PENELOPE-SUITORS)].\n",
      "\n",
      "### The Mythological Journey\n",
      "\n",
      "Odysseus’s return is beleaguered by divine adversarial actions, especially from Neptune, who persecutes him, extending his detainment on a remote island [Data: Reports]. The intervention by gods like Jove and Saturn situates the narrative within a grand mythological context. Minerva's advocacy for Odysseus’s return, her actions influenced by Jove's authority, embodies the interplay between divine will and human destinies [Data: Entities (MINERVA, ULYSSES, CALYPSO, OGYGIAN ISLAND)].\n",
      "\n",
      "Beyond Ithaca, Odysseus's protracted journey is menaced by figures such as Calypso and Hyperion, who are integral to the mythic barriers he faces. His longing and heroic status are underscored during his extended captivity, which symbolizes a broader theme of struggle between human resilience and divine scheming [Data: Entities (CALYPSO, THE GODS); Relationships (ULYSSES-CALYPSO, ULYSSES-THE GODS)].\n",
      "\n",
      "### Divine and Moral Themes\n",
      "\n",
      "Interwoven into the human narrative is a complex web of divine interaction with mortals, highlighting themes of fate, counsel, and retaliation. Masters of fate such as Jove and Mercury orchestrate and warn, maintaining order through divine justice and punishment. The interactions between Olympian beings like Athena and mythic heroes underline a narrative deeply entangled with themes of divine intervention and mortal agency [Data: Reports (+more)].\n",
      "\n",
      "The story of Odysseus encapsulates not only the epic struggle of a hero’s return but also reflects on the realms of mythos and logos interfused with the mortal coil, governed by divine watchfulness and occasionally dictated fate.\n"
     ]
    }
   ],
   "source": [
    "print(global_retriever(\"What is this story about?\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "cd2889a9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7e90d98c2e10>, keys=[])"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "entities, _, _ = neo4j_driver.execute_query(\n",
    "    \"\"\"\n",
    "MATCH (e:__Entity__)\n",
    "RETURN e.summary AS summary, e.name AS name\n",
    "\"\"\"\n",
    ")\n",
    "data = [{\"name\": el[\"name\"], \"embedding\": embed(el[\"summary\"] or el[\"name\"]).tolist()} for el in entities]\n",
    "neo4j_driver.execute_query(\n",
    "    \"\"\"\n",
    "UNWIND $data AS row\n",
    "MATCH (e:__Entity__ {name: row.name})\n",
    "CALL db.create.setNodeVectorProperty(e, 'embedding', row.embedding)\n",
    "\"\"\",\n",
    "    data=data,\n",
    ")\n",
    "\n",
    "neo4j_driver.execute_query(\n",
    "    \"\"\"\n",
    "CREATE VECTOR INDEX entities IF NOT EXISTS\n",
    "FOR (n:__Entity__)\n",
    "ON (n.embedding)\n",
    "\"\"\",\n",
    "    data=data,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "0ddc2454",
   "metadata": {},
   "outputs": [],
   "source": [
    "local_search_query = \"\"\"\n",
    "CALL db.index.vector.queryNodes('entities', $k, $embedding)\n",
    "YIELD node, score\n",
    "WITH collect(node) as nodes\n",
    "WITH collect {\n",
    "    UNWIND nodes as n\n",
    "    MATCH (n)<-[:HAS_ENTITY]->(c:__Chunk__)\n",
    "    WITH c, count(distinct n) as freq\n",
    "    RETURN c.text AS chunkText\n",
    "    ORDER BY freq DESC\n",
    "    LIMIT $topChunks\n",
    "} AS text_mapping,\n",
    "collect {\n",
    "    UNWIND nodes as n\n",
    "    MATCH (n)-[:IN_COMMUNITY]->(c:__Community__)\n",
    "    WITH c, c.rank as rank, c.weight AS weight\n",
    "    RETURN c.summary \n",
    "    ORDER BY rank, weight DESC\n",
    "    LIMIT $topCommunities\n",
    "} AS report_mapping,\n",
    "collect {\n",
    "    UNWIND nodes as n\n",
    "    MATCH (n)-[r:SUMMARIZED_RELATIONSHIP]-(m) \n",
    "    WHERE m IN nodes\n",
    "    RETURN r.summary AS descriptionText\n",
    "    ORDER BY r.rank, r.weight DESC \n",
    "    LIMIT $topInsideRels\n",
    "} as insideRels,\n",
    "collect {\n",
    "    UNWIND nodes as n\n",
    "    RETURN n.summary AS descriptionText\n",
    "} as entities\n",
    "RETURN {Chunks: text_mapping, Reports: report_mapping, \n",
    "       Relationships: insideRels, \n",
    "       Entities: entities} AS text\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "b6161b88",
   "metadata": {},
   "outputs": [],
   "source": [
    "k_entities = 5\n",
    "\n",
    "topChunks = 3\n",
    "topCommunities = 3\n",
    "topInsideRels = 3\n",
    "\n",
    "\n",
    "def local_search(query: str) -> str:\n",
    "    context, _, _ = neo4j_driver.execute_query(\n",
    "        local_search_query,\n",
    "        embedding=embed(query).tolist(),\n",
    "        topChunks=topChunks,\n",
    "        topCommunities=topCommunities,\n",
    "        topInsideRels=topInsideRels,\n",
    "        k=k_entities,\n",
    "    )\n",
    "    context_str = str(context[0][\"text\"])\n",
    "    local_messages = [\n",
    "        {\n",
    "            \"role\": \"system\",\n",
    "            \"content\": ch07_tools.get_local_system_prompt(context_str),\n",
    "        },\n",
    "        {\n",
    "            \"role\": \"user\",\n",
    "            \"content\": query,\n",
    "        },\n",
    "    ]\n",
    "    final_answer = chat(local_messages, model=\"gpt-4o\")\n",
    "    return final_answer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "a55950ae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ulysses, also known as Odysseus, is a legendary Greek hero known for his intelligence, cunning, and piety. He is the rightful king or chief of Ithaca, where he is recognized as a central figure both in his absence and presence [Data: Entities (None)]. Ulysses gained fame for his crucial role in the Trojan War, where his strategic acumen and leadership skills were instrumental in the fall of Troy. Celebrated as the hero who helped sack the city, his narratives are deeply interwoven with the mythic tales of ancient Greece [Data: Entities (None)].\n",
      "\n",
      "His journey following the Trojan War is notable for its series of harrowing adventures and hardships. Ulysses endured numerous challenges at sea, striving to return home and ensure the safety of his crew. Unfortunately, he was unable to save all his men. Throughout these wanderings, he visited many cities and nations, characterizing his journey as one of exploration and survival [Data: Entities (None)]. Despite the odds, the deities have decreed that Ulysses will eventually return to his homeland, emphasizing his significance both to his family and to the divine world [Data: Entities (None)].\n",
      "\n",
      "In his personal life, Ulysses is married to Penelope and is the father of Telemachus. His prolonged absence from Ithaca left a substantial power vacuum in his household. During this time, his wife and son have faced uncertainties. While many presume him dead, others hold hope that he is alive somewhere, stranded or detained. This unresolved status fuels both the narrative tension in his story and the actual power struggles in Ithaca [Data: Entities (None)]. Presently, he is held captive by the goddess Calypso on the remote, forested island of Ogygia, longing to return home, encapsulating his role as a central figure of both mortal and divine concerns [Data: Entities (None)].\n"
     ]
    }
   ],
   "source": [
    "print(local_search(\"Who is Ulysses?\"))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
